{
  "account_onboarding": [
    {
      "q": "How do I apply for a new credit card?",
      "a": "You can apply through the app or website by completing a short form and submitting KYC documents."
    },
    {
      "q": "Who is eligible for a credit card?",
      "a": "Eligibility depends on age, income, and credit score. FinAI can check your eligibility quickly."
    },
    {
      "q": "What documents are required to apply?",
      "a": "You typically need a valid ID, address proof, and PAN card. The app guides you step-by-step."
    },
    {
      "q": "Can I apply for multiple credit cards?",
      "a": "Yes, but approvals depend on your credit limit and banking policies. FinAI can suggest suitable options."
    },
    {
      "q": "Can I update my personal details after account creation?",
      "a": "Yes, details like email, phone number, and address can be updated after verification."
    },
    {
      "q": "What types of credit cards are available?",
      "a": "We offer rewards, cashback, travel, and business credit cards. FinAI can suggest the best option for you."
    },
    {
      "q": "How long does account verification take?",
      "a": "KYC verification is usually completed within 24–48 hours after submission."
    },
    {
      "q": "Can I check my credit limit?",
      "a": "Yes, ask 'What is my credit limit?' and FinAI will provide your current limit instantly."
    },
    {
      "q": "How can I close my credit card account?",
      "a": "You can request account closure through the app after settling outstanding dues."
    },
    {
      "q": "Can I link my card to multiple bank accounts?",
      "a": "Yes, you can select a primary account for payments but multiple accounts can be added for convenience."
    },
    {
      "q": "Is my personal data safe?",
      "a": "Absolutely. We follow strict banking security standards and encryption policies."
    }
  ],

  "card_delivery": [
    {
      "q": "How long does card delivery take?",
      "a": "Cards are usually delivered within 3–7 business days once approved."
    },
    {
      "q": "Can I track my card delivery?",
      "a": "Yes — you will receive an SMS and email with a tracking link once your card is dispatched."
    },
    {
      "q": "Can I change my delivery address after applying?",
      "a": "Yes, if your card hasn't been dispatched yet. Verification is required to update the address."
    },
    {
      "q": "My card was marked delivered but I didn’t receive it. What should I do?",
      "a": "FinAI can raise a courier investigation and request a replacement card if necessary."
    },
    {
      "q": "Can I request express delivery?",
      "a": "Express delivery may be available depending on your location. FinAI can check eligibility."
    },
    {
      "q": "How will I receive my card PIN?",
      "a": "Your PIN will be sent via SMS or you can set a custom PIN through the app."
    },
    {
      "q": "What should I do if my card is damaged upon delivery?",
      "a": "You can report it immediately via FinAI to request a replacement card."
    },
    {
      "q": "Can someone else receive my card on my behalf?",
      "a": "Yes, but proper identity verification is required for security reasons."
    },
    {
      "q": "Will I get an email confirmation when my card is dispatched?",
      "a": "Yes, FinAI will send dispatch notifications with tracking details."
    },
    {
      "q": "Can I temporarily hold my card delivery?",
      "a": "Yes, FinAI can help request a hold or reschedule the delivery date."
    }
  ],

  "transactions_emi": [
    {
      "q": "How can I view my recent transactions?",
      "a": "Just ask 'Show my recent transactions' and FinAI will list them after account verification."
    },
    {
      "q": "How do I convert a purchase into EMI?",
      "a": "Ask 'Convert this transaction to EMI' and FinAI will display available plans."
    },
    {
      "q": "Are there charges for EMI conversion?",
      "a": "Some banks may charge a processing fee or interest. FinAI will show all costs before confirming."
    },
    {
      "q": "What is the minimum transaction amount for EMI?",
      "a": "Transactions above ₹1,500 are typically eligible. Exceptions may apply."
    },
    {
      "q": "Can I convert multiple transactions into EMI at once?",
      "a": "Yes, if each transaction meets eligibility criteria. FinAI can process them together."
    },
    {
      "q": "How do I dispute a suspicious transaction?",
      "a": "Select the transaction or provide details and FinAI will raise a dispute on your behalf."
    },
    {
      "q": "Can international transactions be converted to EMI?",
      "a": "No, most international transactions, wallet loads, and cash withdrawals are not eligible."
    },
    {
      "q": "How can I categorize my transactions?",
      "a": "FinAI can help tag and categorize transactions for easier tracking and budgeting."
    },
    {
      "q": "Can I get notifications for large transactions?",
      "a": "Yes, FinAI can alert you via SMS or app notifications for transactions above a set limit."
    },
    {
      "q": "Is there a limit on EMI duration?",
      "a": "EMI plans usually range from 3 to 24 months. FinAI will show available durations for each transaction."
    }
  ],

  "bill_and_statement": [
    {
      "q": "When is my bill generated?",
      "a": "Your statement is generated monthly based on your billing cycle date."
    },
    {
      "q": "Can I download past statements?",
      "a": "Yes — you can download up to 24 months of past statements from your app or request via FinAI."
    },
    {
      "q": "Can I change my billing cycle?",
      "a": "Some banks allow changing billing cycles. FinAI can check eligibility and assist in the change."
    },
    {
      "q": "Why is my bill higher this month?",
      "a": "Higher bills may include new transactions, interest, fees, or EMI charges. FinAI can provide a detailed breakdown."
    },
    {
      "q": "How can I get my statement emailed?",
      "a": "FinAI can email your statement instantly once you request it."
    },
    {
      "q": "Can I get a duplicate statement?",
      "a": "Yes, duplicate statements can be generated anytime for previous months."
    },
    {
      "q": "How do I read my statement?",
      "a": "FinAI can guide you through each section of your statement including transactions, fees, and due amount."
    },
    {
      "q": "Are digital statements secure?",
      "a": "Yes, all statements are encrypted and securely delivered through authenticated channels."
    },
    {
      "q": "Can I subscribe to e-statements only?",
      "a": "Yes, FinAI can update your preference to receive only digital statements."
    },
    {
      "q": "What is the minimum payment on my bill?",
      "a": "The minimum amount is usually 5% of the total outstanding or as defined by your bank."
    }
  ],

  "repayments": [
    {
      "q": "What are repayment options?",
      "a": "You can pay via UPI, net banking, AutoPay, credit card apps, or NEFT."
    },
    {
      "q": "Is there a grace period?",
      "a": "A grace period of 2–3 days may apply depending on your bank and payment method."
    },
    {
      "q": "Can I pay more than the minimum amount?",
      "a": "Yes, paying more reduces interest charges. FinAI can help you specify an amount."
    },
    {
      "q": "Can I set up automatic payments?",
      "a": "Yes, AutoPay can be set for minimum or full payment each month after verification."
    },
    {
      "q": "How do I check my outstanding balance?",
      "a": "Ask 'What is my outstanding balance?' and FinAI will provide the latest amount."
    },
    {
      "q": "Can I schedule a payment for a future date?",
      "a": "Yes, FinAI can schedule a payment on any date you choose."
    },
    {
      "q": "Are there penalties for late payment?",
      "a": "Late payments may incur fees and interest. FinAI can show exact charges for your account."
    },
    {
      "q": "Can I change my repayment method?",
      "a": "Yes, you can switch between UPI, net banking, or AutoPay anytime."
    },
    {
      "q": "How do I know if my payment was successful?",
      "a": "FinAI confirms each successful payment with a receipt and notification."
    },
    {
      "q": "Can I make partial payments?",
      "a": "Yes, partial payments are allowed and will reflect in your outstanding balance."
    }
  ],

  "collections_overdue": [
    {
      "q": "What happens if my payment is overdue?",
      "a": "Late payments may incur fees and interest. FinAI can guide you on repayment options."
    },
    {
      "q": "Can I pay part of my overdue bill?",
      "a": "Yes, FinAI can help you make a partial payment towards your overdue amount."
    },
    {
      "q": "Will late payments affect my credit score?",
      "a": "Yes, overdue payments may impact your credit score. FinAI can suggest ways to minimize the effect."
    },
    {
      "q": "Can I request extra time to pay?",
      "a": "Some banks allow extensions or repayment plans. FinAI can check your eligibility."
    },
    {
      "q": "How do I get reminders for overdue bills?",
      "a": "FinAI can send notifications via SMS, email, or in-app alerts before and after due dates."
    },
    {
      "q": "Can I speak to a collections agent?",
      "a": "Yes, FinAI can connect you to customer support for overdue account assistance."
    },
    {
      "q": "Are there options to restructure my overdue payments?",
      "a": "Yes, FinAI can help explore repayment plans or settlements if eligible."
    },
    {
      "q": "Will my account be blocked if I miss a payment?",
      "a": "Accounts may be temporarily restricted. FinAI can guide you on restoring access."
    },
    {
      "q": "Are partial payments counted towards reducing interest?",
      "a": "Yes, any payment reduces the principal and accrued interest accordingly."
    },
    {
      "q": "Can I automate overdue repayment notifications?",
      "a": "Yes, FinAI can schedule recurring reminders until payment is completed."
    }
  ]
}
